{
  "backend/main.mo": "Motoko canister handling user profiles and per-user composition storage with access control and CRUD operations.",
  "feature_evidence.json": "Feature mapping file linking implemented recording and UI features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the studio, composer, recording, and audio systems.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app with metadata, favicon, and main script reference.",
  "frontend/src/App.tsx": "Main React app component managing authentication, profile setup, studio UI, composer mode, and video/audio recorder dialogs.",
  "frontend/src/audio/audioImport.ts": "Utility functions for validating, reading, and extracting metadata from imported audio files.",
  "frontend/src/audio/audioTypes.ts": "TypeScript interfaces defining structure for composition state, channels, piano roll notes, amp settings, and imported audio.",
  "frontend/src/audio/serializeComposition.ts": "Serialization utilities encoding composition state to bytes and restoring it with defaults for backward compatibility.",
  "frontend/src/audio/useAudioEngine.ts": "Hook that initializes and controls a Web Audio engine, manages gain nodes, guitar amp effects, playback state, and imported audio handling.",
  "frontend/src/features/auth/LoginButton.tsx": "UI button that toggles login/logout using Internet Identity and manages query cache clearing.",
  "frontend/src/features/composer/AudioTrack.tsx": "Component for importing, validating, previewing, and removing external audio files in a composition.",
  "frontend/src/features/composer/ComposerScreen.tsx": "Main composer UI combining piano roll and audio import tabs with playback controls and layout.",
  "frontend/src/features/composer/PianoRoll.tsx": "Piano roll editor that manages note creation, deletion, zooming, and rendering of the grid and notes.",
  "frontend/src/features/recording/AudioRecorderDialog.tsx": "Dialog for recording audio with controls for start, pause, stop, playback, and error handling.",
  "frontend/src/features/recording/useAudioRecording.ts": "Custom hook managing audio recording with MediaRecorder, duration tracking, error handling, and optional MP3 conversion.",
  "frontend/src/features/recording/useVideoRecording.ts": "Custom hook for video recording, supporting optional audio tracks, duration tracking, stopping, clearing, and downloading recordings.",
  "frontend/src/features/recording/VideoRecorderDialog.tsx": "React dialog wrapping camera preview and video recording controls with quality, audio toggle, error handling, and playback.",
  "frontend/src/features/studio/AmpPanel.tsx": "UI panel for guitar amp settings with interactive knobs, sliders, and a reset option.",
  "frontend/src/features/studio/CompositionManager.tsx": "Component for saving, loading, and deleting compositions, displaying a list and handling composition persistence.",
  "frontend/src/features/studio/InstrumentPanel.tsx": "Renders interactive drum and instrument note grids with toggles and step highlighting, handling updates via callbacks.",
  "frontend/src/features/studio/MixerPanel.tsx": "Displays channel strips with volume, mute, and solo controls plus a master volume slider.",
  "frontend/src/features/studio/TransportBar.tsx": "Provides play/pause control and a tempo slider for transport functions.",
  "frontend/src/features/studio/YouTubePlayer.tsx": "Handles YouTube URL/ID search and displays an embedded player or search guidance.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useCompositions.ts": "Provides hooks to list, save, load, and delete compositions through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, exposing login, logout, and identity context.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks to load and save the caller's user profile using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light/dark modes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client, and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s state, including requirements, features, images, and architecture notes for building a media‑recording website."
}