{
  "backend/main.mo": "Canister handling user profiles and per-user composition storage with authorization checks and CRUD functions for compositions.",
  "backend/migration.mo": "Migration module converting old composition entries to the new format by renaming the data field to composerData.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file related to audio, composer, studio UI, and supporting hooks.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes used across the frontend.",
  "frontend/index.html": "Root HTML file loading the React app and mounting it to the root element.",
  "frontend/src/App.tsx": "Main React component managing authentication, profile setup, studio UI, composer state, and unsaved-change handling.",
  "frontend/src/audio/audioImport.ts": "Utilities for validating, reading, and extracting duration metadata from imported audio files.",
  "frontend/src/audio/audioTypes.ts": "TypeScript interfaces defining composition structure, including channels, amp settings, piano roll notes, and imported audio.",
  "frontend/src/audio/serializeComposition.ts": "Serialization helpers encoding composition state to JSON bytes and restoring it with defaults for new fields.",
  "frontend/src/audio/useAudioEngine.ts": "React hook that initializes an audio engine, manages playback state, gain nodes, guitar amp processing, and imported audio.",
  "frontend/src/features/auth/LoginButton.tsx": "Authentication button that triggers login/logout using Internet Identity and updates UI and query state.",
  "frontend/src/features/composer/AudioTrack.tsx": "Component for importing, validating, previewing, and attaching audio files to a composition.",
  "frontend/src/features/composer/ComposerScreen.tsx": "Main composer UI with piano roll, audio import, and playback controls wrapped in a tabbed interface.",
  "frontend/src/features/composer/PianoRoll.tsx": "Interactive piano roll editor enabling note creation, deletion, zooming, and visualization of timeline steps.",
  "frontend/src/features/studio/AmpPanel.tsx": "Guitar amp settings panel with knobs and sliders for adjusting EQ, drive, presence, and master levels.",
  "frontend/src/features/studio/CompositionManager.tsx": "UI for saving, loading, and deleting compositions using composition hooks, with input for naming and a list of saved items.",
  "frontend/src/features/studio/InstrumentPanel.tsx": "Displays drum and instrument step sequencers with toggles for notes and steps, organized in tabs.",
  "frontend/src/features/studio/MixerPanel.tsx": "Provides channel volume, mute, and solo controls plus a master volume slider for the studio mixer.",
  "frontend/src/features/studio/TransportBar.tsx": "Play/pause transport controls and a tempo slider for controlling studio playback.",
  "frontend/src/features/studio/YouTubePlayer.tsx": "Loads or searches YouTube videos by URL, ID, or query and embeds a player.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCompositions.ts": "React Query hooks for listing, saving, loading, and deleting compositions using backend actor APIs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and tracking status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the current user's profile through an actor API.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and theme variables including color tokens and global typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, grids, animations, and enabling plugins.",
  "project_state.json": "Describes project state, including implemented and pending feature requirements for amp controls and a music composer system."
}