{
  "kind": "build_request",
  "title": "Add in-app camera video recorder and mic audio recorder (MP3) with logo and indexing-ready metadata",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a prominent Camera option in the UI that, when clicked, requests camera permission and opens an in-app video recorder using the device camera.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "THERE SOULD BE A CAMRA OPTION AND WHEN I CLIK it it should open the camera to recode the vidio"
        ]
      },
      "acceptanceCriteria": [
        "A clearly labeled Camera button is visible on the main page.",
        "Clicking Camera triggers the browser permission prompt (when needed) and shows a live camera preview in-app.",
        "The video recorder supports start/stop recording and shows a playback preview after stopping.",
        "The user can download/save the recorded video file from the app.",
        "If the user denies permission or the device has no camera, the UI shows an English error message and a safe retry option."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add multiple video recording options in the in-app video recorder (at minimum: front/back camera switch when available, resolution quality selector, and optional audio on/off toggle).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ADD ME A HIGH QUALITY VIDIO RECODER IN IT WHITH THE OPTION OF VIDIO RECODIG WHITH SO MANY OPTION TO RECDE"
        ]
      },
      "acceptanceCriteria": [
        "When multiple cameras are available, the user can switch between front/back cameras before recording.",
        "The user can choose a recording quality preset (e.g., High/Medium/Low) before recording; the app applies corresponding media constraints.",
        "The user can enable/disable microphone audio capture for video recording before recording begins.",
        "Unsupported options are disabled gracefully with a short English hint (no crashes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a mic-type logo/icon at the end of the main page UI that, when clicked, opens an in-app audio recorder that records from the microphone and lets the user operate it (start/pause/stop).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "for the audio recoder ther should be a mic type logo at the last and when i clik that it should open and let me to work"
        ]
      },
      "acceptanceCriteria": [
        "A mic icon button is visible at the bottom/end of the main page layout.",
        "Clicking the mic icon requests microphone permission (when needed) and opens an audio recorder UI.",
        "The audio recorder supports start, pause/resume, and stop.",
        "If the user denies permission or the device has no microphone, the UI shows an English error message and a safe retry option."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enable saving audio recordings as an MP3 file from the in-app audio recorder, with a download action after recording completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "IT SHOULD LET  ME TO  RECODE THE SONG AND STORE IN MP3 FILE"
        ]
      },
      "acceptanceCriteria": [
        "After stopping an audio recording, the app provides a Download button that saves the recording as an .mp3 file.",
        "The downloaded file has MIME/type and filename consistent with MP3 (e.g., audio/mpeg, *.mp3).",
        "If MP3 encoding fails on the device/browser, the UI shows an English error message and does not lose the recorded audio; it offers an alternative download format if implemented."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Replace the current letter-based header mark with the user’s logo image and ensure it appears in the header on all main screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          ", logo,"
        ]
      },
      "acceptanceCriteria": [
        "The header displays the provided/generated logo image instead of the single-letter placeholder.",
        "The logo renders crisply on mobile and desktop and has appropriate alt text in English.",
        "The logo asset is served from frontend static assets (not fetched from the backend)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Make the site indexing-ready by adding basic SEO metadata to the HTML head (title, meta description, and Open Graph tags) using English text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i need  my own URL website to upload to google search"
        ]
      },
      "acceptanceCriteria": [
        "The app’s HTML head includes a descriptive <title> and a meta description in English.",
        "Open Graph tags (og:title, og:description) are present in English.",
        "No user-facing text added by this change uses non-English language."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI sources must be composed, not modified).",
    "Do not edit the immutable authentication/actor hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Use only in-browser recording APIs (MediaDevices/MediaRecorder) and keep recording flows user-gesture initiated to satisfy browser security requirements."
  ],
  "nonGoals": [
    "Implementing a guaranteed custom domain/URL purchase or automated Google Search Console submission (outside the app’s scope).",
    "Server-side video/audio transcoding or storing recordings in an external database/service.",
    "Adding real-time streaming, WebSockets, or live broadcasting."
  ],
  "imageRequirements": {
    "required": [
      "Modern music/recording brand logo with a clean mic + camera motif, warm amber/orange accent on dark background (app-logo.dim_512x512.png)",
      "Square favicon version of the same logo, simplified for small sizes (favicon.dim_32x32.png)"
    ],
    "edits": []
  }
}