{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app camera video recorder + mic audio recorder (MP3), logo swap, and SEO metadata",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a prominent Camera button on the main page that opens an in-app video recorder with live preview, recording controls, playback, and download, with safe error handling.",
      "acceptanceCriteria": [
        "A clearly labeled Camera button is visible on the main page.",
        "Clicking Camera triggers the browser permission prompt (when needed) and shows a live camera preview in-app.",
        "The video recorder supports start/stop recording and shows a playback preview after stopping.",
        "The user can download/save the recorded video file from the app.",
        "If the user denies permission or the device has no camera, the UI shows an English error message and a safe retry option."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/recording/VideoRecorderDialog.tsx",
          "operation": "create",
          "description": "Create an in-app video recorder dialog: shows a stable-sized live preview, Start/Stop recording controls, playback preview after stopping, and a Download action; handle permission denial/not-found/not-supported with English messages and a Retry action. Use the selected camera component hook (useCamera from the camera component) to power preview/start/stop/switch behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/recording/useVideoRecording.ts",
          "operation": "create",
          "description": "Create a React hook that uses in-browser MediaRecorder on the active camera preview stream (derived from the preview video element's srcObject) to implement start/stop recording, produce a Blob + object URL, and expose download-ready metadata (filename, mimeType). Ensure all recording actions are user-gesture initiated and errors are surfaced as English strings."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire a prominent Camera button into the existing main page layout (near existing primary actions) and open the VideoRecorderDialog from a user click; ensure the dialog is reachable with no new top-level routes and that error states provide safe retry."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add camera recorder options: front/back switch (when available), quality preset selection, and optional mic audio toggle, all applied safely before recording.",
      "acceptanceCriteria": [
        "When multiple cameras are available, the user can switch between front/back cameras before recording.",
        "The user can choose a recording quality preset (e.g., High/Medium/Low) before recording; the app applies corresponding media constraints.",
        "The user can enable/disable microphone audio capture for video recording before recording begins.",
        "Unsupported options are disabled gracefully with a short English hint (no crashes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/recording/VideoRecorderDialog.tsx",
          "operation": "modify",
          "description": "Add recorder options UI: (1) front/back camera toggle using the camera component's switching capability when supported, (2) quality preset selector mapped to media constraints (ideal width/height), and (3) audio on/off toggle to include/exclude microphone capture for video recording. Disable unsupported controls with a short English hint. Use the selected camera component hook (useCamera) for preview and switching; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/recording/useVideoRecording.ts",
          "operation": "modify",
          "description": "Apply chosen options before recording begins: restart camera preview when quality or facing mode changes; when audio is enabled, request microphone capture at recording start and merge audio track with the preview video track for MediaRecorder; if mic capture is unavailable/denied, show an English hint and continue with silent video (no crash)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a mic icon button at the end of the main page that opens an in-app microphone audio recorder with start/pause/resume/stop and safe permission error handling.",
      "acceptanceCriteria": [
        "A mic icon button is visible at the bottom/end of the main page layout.",
        "Clicking the mic icon requests microphone permission (when needed) and opens an audio recorder UI.",
        "The audio recorder supports start, pause/resume, and stop.",
        "If the user denies permission or the device has no microphone, the UI shows an English error message and a safe retry option."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/recording/AudioRecorderDialog.tsx",
          "operation": "create",
          "description": "Create an in-app audio recorder dialog opened from a mic icon button: Start, Pause/Resume, Stop; show recording status and duration; handle permission denial/not-found/not-supported with English messages and a Retry action."
        },
        {
          "path": "frontend/src/features/recording/useAudioRecording.ts",
          "operation": "create",
          "description": "Create a React hook that uses MediaDevices + MediaRecorder for microphone recording with start/pause/resume/stop; retains the original recorded audio blob so it is never lost if later conversion fails; expose state and English error messages. Keep all permission/recording actions user-gesture initiated."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a mic icon button at the bottom/end of the main page layout and wire it to open AudioRecorderDialog."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enable saving audio recordings as MP3 with a download action after completion, with graceful fallback if MP3 encoding fails.",
      "acceptanceCriteria": [
        "After stopping an audio recording, the app provides a Download button that saves the recording as an .mp3 file.",
        "The downloaded file has MIME/type and filename consistent with MP3 (e.g., audio/mpeg, *.mp3).",
        "If MP3 encoding fails on the device/browser, the UI shows an English error message and does not lose the recorded audio; it offers an alternative download format if implemented."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/recording/mp3Encode.ts",
          "operation": "create",
          "description": "Implement client-side MP3 encoding helper that converts recorded audio into MP3 bytes (audio/mpeg) for download; if encoding fails, return a structured error while preserving access to the original recording for fallback download."
        },
        {
          "path": "frontend/src/features/recording/useAudioRecording.ts",
          "operation": "modify",
          "description": "Add post-stop flow to generate an MP3 blob via mp3Encode.ts and expose a primary Download MP3 action (audio/mpeg, .mp3). If MP3 encoding fails, surface an English error and keep the original recording available for an alternative download format (e.g., the original MediaRecorder blob) without losing audio."
        },
        {
          "path": "frontend/src/features/recording/AudioRecorderDialog.tsx",
          "operation": "modify",
          "description": "Add Download MP3 button after stop that saves the encoded .mp3; if MP3 encoding fails, show an English error and present a fallback download action for the preserved original recording."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Replace the letter-based header mark with the provided logo image across all main screens (including the composer screen) served as a static frontend asset.",
      "acceptanceCriteria": [
        "The header displays the provided/generated logo image instead of the single-letter placeholder.",
        "The logo renders crisply on mobile and desktop and has appropriate alt text in English.",
        "The logo asset is served from frontend static assets (not fetched from the backend)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/app-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated logo image asset at frontend/public/assets/generated/app-logo.dim_512x512.png and ensure it is referenced as a static asset in the UI."
        },
        {
          "path": "frontend/public/assets/generated/favicon.dim_32x32.png",
          "operation": "create",
          "description": "Add the generated favicon asset at frontend/public/assets/generated/favicon.dim_32x32.png for use in the HTML head."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the current letter-based header mark with the static logo image (frontend/public/assets/generated/app-logo.dim_512x512.png), including English alt text; ensure sizing remains crisp and responsive."
        },
        {
          "path": "frontend/src/features/composer/ComposerScreen.tsx",
          "operation": "modify",
          "description": "Replace the composer screen header letter mark with the same static logo image (frontend/public/assets/generated/app-logo.dim_512x512.png) and English alt text so it appears on all main screens."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add basic SEO and Open Graph metadata in English to make the site indexing-ready.",
      "acceptanceCriteria": [
        "The app’s HTML head includes a descriptive <title> and a meta description in English.",
        "Open Graph tags (og:title, og:description) are present in English.",
        "No user-facing text added by this change uses non-English language."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML head with an English <title>, meta description, and Open Graph tags (og:title, og:description). Add a favicon link pointing to frontend/public/assets/generated/favicon.dim_32x32.png."
        }
      ]
    }
  ]
}